<details><summary>Plan: 4 to add, 1 to change, 0 to destroy.</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
~   update in-place

Terraform will perform the following actions:

  # cloudfoundry_app.tts-10x-forms-demo-sandbox_tts-10x-forms-demo-sandbox-app_540407CF will be created
+   resource "cloudfoundry_app" "tts-10x-forms-demo-sandbox_tts-10x-forms-demo-sandbox-app_540407CF" {
+       buildpack                       = (known after apply)
+       disk_quota                      = 4096
+       docker_image                    = "ghcr.io/gsa-tts/forms/sandbox:183809de98ec25c3e38dff1e25e4933387b21195"
+       enable_ssh                      = (known after apply)
+       environment                     = (sensitive value)
+       health_check_http_endpoint      = "/"
+       health_check_invocation_timeout = (known after apply)
+       health_check_timeout            = (known after apply)
+       health_check_type               = "http"
+       id                              = (known after apply)
+       id_bg                           = (known after apply)
+       instances                       = 1
+       memory                          = 1024
+       name                            = "tts-10x-forms-demo-sandbox-app"
+       ports                           = (known after apply)
+       space                           = "c003594e-9b13-43ec-b8ef-723393d44dba"
+       stack                           = (known after apply)
+       stopped                         = false
+       strategy                        = "none"
+       timeout                         = 300

+       routes {
+           port  = (known after apply)
+           route = (known after apply)
        }

+       service_binding {
+           service_instance = (known after apply)
        }
+       service_binding {
+           service_instance = (known after apply)
        }
    }

  # cloudfoundry_app.tts-10x-forms-demo-server-doj_tts-10x-forms-demo-server-doj-app_88F24765 will be updated in-place
~   resource "cloudfoundry_app" "tts-10x-forms-demo-server-doj_tts-10x-forms-demo-server-doj-app_88F24765" {
~       docker_image                    = "ghcr.io/gsa-tts/forms/server-doj:abf5c1509aea6a3a4ad4a7b661551adec783cd4b" -> "ghcr.io/gsa-tts/forms/server-doj:183809de98ec25c3e38dff1e25e4933387b21195"
        id                              = "db85f8bc-3662-4bbc-9e35-7e4b000428db"
~       memory                          = 512 -> 1024
        name                            = "tts-10x-forms-demo-server-doj-app"
        # (16 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # cloudfoundry_route.tts-10x-forms-demo-sandbox_tts-10x-forms-demo-sandbox-route_88325E24 will be created
+   resource "cloudfoundry_route" "tts-10x-forms-demo-sandbox_tts-10x-forms-demo-sandbox-route_88325E24" {
+       domain   = "50ba3f69-cd54-4963-9172-14f3334b479e"
+       endpoint = (known after apply)
+       hostname = "tts-10x-forms-demo-sandbox"
+       id       = (known after apply)
+       port     = (known after apply)
+       space    = "c003594e-9b13-43ec-b8ef-723393d44dba"
    }

  # cloudfoundry_service_instance.tts-10x-forms-demo-sandbox_tts-10x-forms-demo-sandbox-db_57280448 will be created
+   resource "cloudfoundry_service_instance" "tts-10x-forms-demo-sandbox_tts-10x-forms-demo-sandbox-db_57280448" {
+       id                             = (known after apply)
+       json_params                    = jsonencode(
            {
+               version = "15"
            }
        )
+       name                           = "tts-10x-forms-demo-sandbox-db"
+       replace_on_params_change       = false
+       replace_on_service_plan_change = false
+       service_plan                   = "5ed9f319-4c75-4851-9885-598a96b7febc"
+       space                          = "c003594e-9b13-43ec-b8ef-723393d44dba"

+       timeouts {
+           create = "60m"
+           delete = "2h"
+           update = "60m"
        }
    }

  # cloudfoundry_user_provided_service.tts-10x-forms-demo-sandbox_tts-10x-forms-demo-sandbox-login-gov-service_471ACBB0 will be created
+   resource "cloudfoundry_user_provided_service" "tts-10x-forms-demo-sandbox_tts-10x-forms-demo-sandbox-login-gov-service_471ACBB0" {
+       credentials = (sensitive value)
+       id          = (known after apply)
+       name        = "tts-10x-forms-demo-sandbox-login-gov-service"
+       space       = "c003594e-9b13-43ec-b8ef-723393d44dba"
    }

Plan: 4 to add, 1 to change, 0 to destroy.
```
</details>

<!-- Sticky Pull Request Commentterraform-plan -->